<?php get_header(); ?>
<?php if ( have_posts() ) : while ( have_posts() ) : the_post(); ?>
<div class="jumbotron" style="background-image: url('<?php header_image(); ?>')">
	<div class="jumbotron-background container container-big align-center">
        <?php showPageInfo('knowledgeBase'); ?>
	</div>
</div>
<main id="breakPointForNav" class="container content-wrapper-normal separator">
    <div class="grid-test content-above">
        <?php
        $post_thumbnail = function() {
            if ( has_post_thumbnail() ) : return get_the_post_thumbnail();
            else : return '<img alt="'. get_the_title(). '" src="'. get_template_directory_uri() . '/files/img/empty-thumbnail.png" />';
            endif;
        };
        echo $post_thumbnail();
        ?>
        <?php the_title('<h1>', '</h1>'); ?>
        <div class="post-metadata-top">
            <ul class="page-metadata">
                <li><svg class="meta-icon" xmlns="http://www.w3.org/2000/svg" width="48" height="48" viewBox="0 0 48 48"><path d="M42 20.25H28.43l5.49-5.64c-5.46-5.41-14.3-5.61-19.76-.2-5.46 5.41-5.46 14.17 0 19.58 5.46 5.41 14.3 5.41 19.76 0 2.72-2.7 4.08-5.83 4.07-9.79H42c0 3.96-1.76 9.1-5.28 12.59-7.02 6.95-18.42 6.95-25.44 0s-7.07-18.22-.05-25.17c7.01-6.95 18.29-6.95 25.3 0L42 6v14.25zM25 16v8.5l7 4.16-1.44 2.42L22 26V16h3z"/></svg><?php the_time('Y/m/d'); ?></li>
                <li><svg class="meta-icon" xmlns="http://www.w3.org/2000/svg" width="48" height="48" viewBox="0 0 48 48"> <path d="M42 20.25H28.43l5.49-5.64c-5.46-5.41-14.3-5.61-19.76-.2-5.46 5.41-5.46 14.17 0 19.58 5.46 5.41 14.3 5.41 19.76 0 2.72-2.7 4.08-5.83 4.07-9.79H42c0 3.96-1.76 9.1-5.28 12.59-7.02 6.95-18.42 6.95-25.44 0s-7.07-18.22-.05-25.17c7.01-6.95 18.29-6.95 25.3 0L42 6v14.25zM25 16v8.5l7 4.16-1.44 2.42L22 26V16h3z"/></svg><?php the_modified_date('Y/m/d'); ?></li>
				<?php if (has_category()): ?>
                <li><svg class="meta-icon" xmlns="http://www.w3.org/2000/svg" width="24" height="24" viewBox="0 0 24 24"><path fill-rule="evenodd" d="M3,11 L3,19 L21,19 L21,11 L3,11 Z M3,9 L21,9 L21,7 L11.994646,6.99998567 C11.2764915,6.99614058 10.8086916,6.65990923 10.3058322,6.03654146 C10.2364281,5.95050497 10.0158737,5.66440398 9.98159778,5.62115916 C9.60702158,5.14856811 9.38424442,5 9,5 L3,5 L3,9 Z M21,5 C22.1045695,5 23,5.8954305 23,7 L23,19 C23,20.1045695 22.1045695,21 21,21 L3,21 C1.8954305,21 1,20.1045695 1,19 L1,5 C1,3.8954305 1.8954305,3 3,3 L9,3 C10.1200023,3 10.832939,3.47545118 11.5489764,4.37885309 C11.5967547,4.43913352 11.8100999,4.71588275 11.8624831,4.78081945 C12.019726,4.97574495 12.0517795,4.99972956 12.0017863,5 L21,5 Z"/></svg><?php the_category(', '); ?></li>
                <?php endif; ?>
                <li><?php edit_post_link( 'Edit', '<svg class="meta-icon" xmlns="http://www.w3.org/2000/svg" width="24" height="24" viewBox="0 0 24 24"><path fill-rule="evenodd" d="M14.8024118,6.44526791 L8.69610276,12.549589 C8.29095108,12.9079238 8.04030835,13.4092335 8,13.8678295 L8,16.0029438 L10.0639829,16.004826 C10.5982069,15.9670062 11.0954869,15.7183782 11.4947932,15.2616227 L17.556693,9.19972295 L14.8024118,6.44526791 Z M16.2168556,5.0312846 L18.9709065,7.78550938 L19.8647941,6.89162181 C19.9513987,6.80501747 20.0000526,6.68755666 20.0000526,6.56507948 C20.0000526,6.4426023 19.9513987,6.32514149 19.8647932,6.23853626 L17.7611243,4.13485646 C17.6754884,4.04854589 17.5589355,4 17.43735,4 C17.3157645,4 17.1992116,4.04854589 17.1135757,4.13485646 L16.2168556,5.0312846 Z M22,13 L22,20 C22,21.1045695 21.1045695,22 20,22 L4,22 C2.8954305,22 2,21.1045695 2,20 L2,4 C2,2.8954305 2.8954305,2 4,2 L11,2 L11,4 L4,4 L4,20 L20,20 L20,13 L22,13 Z M17.43735,2 C18.0920882,2 18.7197259,2.26141978 19.1781068,2.7234227 L21.2790059,4.82432181 C21.7406843,5.28599904 22.0000526,5.91216845 22.0000526,6.56507948 C22.0000526,7.21799052 21.7406843,7.84415992 21.2790068,8.30583626 L12.9575072,16.6237545 C12.2590245,17.4294925 11.2689,17.9245308 10.1346,18.0023295 L6,18.0023295 L6,17.0023295 L6.00324765,13.7873015 C6.08843822,12.7328366 6.57866679,11.7523321 7.32649633,11.0934196 L15.6953877,2.72462818 C16.1563921,2.2608295 16.7833514,2 17.43735,2 Z"/></svg>'); ?></li>
            </ul>
        </div>

        <?php if (has_tag()): ?>
            <div class="post-metadata-bottom">
                <div class="">
                    <svg class="meta-icon" xmlns="http://www.w3.org/2000/svg" width="24" height="24" viewBox="0 0 24 24"><path fill-rule="evenodd" d="M6.53518376,5 L21,5 C22.1045695,5 23,5.8954305 23,7 L23,17 C23,18.1045695 22.1045695,19 21,19 L6.53518376,19 C5.86647738,19 5.24201473,18.6657977 4.87108317,18.1094004 L1.16794971,12.5547002 C0.944016765,12.2188008 0.944016765,11.7811992 1.16794971,11.4452998 L4.87108317,5.89059961 C5.24201473,5.33420227 5.86647738,5 6.53518376,5 Z M3.20185043,12 L6.53518376,17 L21,17 L21,7 L6.53518376,7 L3.20185043,12 Z M7,13 C6.44771525,13 6,12.5522847 6,12 C6,11.4477153 6.44771525,11 7,11 C7.55228475,11 8,11.4477153 8,12 C8,12.5522847 7.55228475,13 7,13 Z"/></svg>
                </div>
                <?php the_tags ('<ul class="tags-wrapper"><li class="tag">', '</li><li class="tag">', '</li></ul>' ); ?>
            </div>
        <?php endif; ?>
    </div>
    <?php echo '<section class="content-wrapper-normal content-rules">';?>
    <?php the_content();?>
    <?php echo '</section>';?>
    <?php
    the_post_navigation(array( 'prev_text' => '前の投稿へ', 'next_text' => '次の投稿へ', 'class' => 'post-navigation', ));
    if ( comments_open() || get_comments_number() ) :
        comments_template();
    endif;
    ?>
    <?php endwhile; endif; ?>
</main>
<?php get_footer();